In [1]:
%config IPCompleter.greedy=True
!pip install ipython --upgrade
!pip install jedi
!pip3 install jupyter-tabnine
!jupyter nbextension install --py jupyter_tabnine
!jupyter nbextension enable --py jupyter_tabnine
!jupyter serverextension enable --py jupyter_tabnine

Requirement already satisfied: ipython in c:\users\hp\anaconda3\lib\site-packages (7.22.0)
Collecting ipython
  Downloading ipython-7.28.0-py3-none-any.whl (788 kB)
Requirement already satisfied: jedi>=0.16 in c:\users\hp\anaconda3\lib\site-packages (from ipython) (0.17.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\hp\anaconda3\lib\site-packages (from ipython) (3.0.17)
Requirement already satisfied: backcall in c:\users\hp\anaconda3\lib\site-packages (from ipython) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\hp\anaconda3\lib\site-packages (from ipython) (52.0.0.post20210125)
Requirement already satisfied: traitlets>=4.2 in c:\users\hp\anaconda3\lib\site-packages (from ipython) (5.0.5)
Requirement already satisfied: decorator in c:\users\hp\anaconda3\lib\site-packages (from ipython) (5.0.6)
Requirement already satisfied: pygments in c:\users\hp\anaconda3\lib\site-packages (from ipython) (2.8.1)
Requirement already satisfied: colorama in c:\users\hp\anaconda3\lib\site-packages (from ipython) (0.4.4)
Collecting matplotlib-inline
  Downloading matplotlib_inline-0.1.3-py3-none-any.whl (8.2 kB)
Requirement already satisfied: pickleshare in c:\users\hp\anaconda3\lib\site-packages (from ipython) (0.7.5)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\hp\anaconda3\lib\site-packages (from jedi>=0.16->ipython) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\hp\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython) (0.2.5)
Requirement already satisfied: ipython-genutils in c:\users\hp\anaconda3\lib\site-packages (from traitlets>=4.2->ipython) (0.2.0)
Installing collected packages: matplotlib-inline, ipython
  Attempting uninstall: ipython
    Found existing installation: ipython 7.22.0
    Uninstalling ipython-7.22.0:
      Successfully uninstalled ipython-7.22.0
Successfully installed ipython-7.28.0 matplotlib-inline-0.1.3

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
spyder 4.2.5 requires pyqt5<5.13, which is not installed.
spyder 4.2.5 requires pyqtwebengine<5.13, which is not installed.

Requirement already satisfied: jedi in c:\users\hp\anaconda3\lib\site-packages (0.17.2)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\hp\anaconda3\lib\site-packages (from jedi) (0.7.0)
Collecting jupyter-tabnine
  Downloading jupyter_tabnine-1.2.3-py2.py3-none-any.whl (21 kB)
Requirement already satisfied: nbconvert in c:\users\hp\anaconda3\lib\site-packages (from jupyter-tabnine) (6.0.7)
Requirement already satisfied: ipython in c:\users\hp\anaconda3\lib\site-packages (from jupyter-tabnine) (7.28.0)
Requirement already satisfied: notebook>=4.2 in c:\users\hp\anaconda3\lib\site-packages (from jupyter-tabnine) (6.3.0)
Requirement already satisfied: jupyter-core in c:\users\hp\anaconda3\lib\site-packages (from jupyter-tabnine) (4.7.1)
Requirement already satisfied: ipython-genutils in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (0.2.0)
Requirement already satisfied: traitlets>=4.2.1 in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (5.0.5)
Requirement already satisfied: jinja2 in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (2.11.3)
Requirement already satisfied: prometheus-client in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (0.10.1)
Requirement already satisfied: tornado>=6.1 in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (6.1)
Requirement already satisfied: pyzmq>=17 in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (20.0.0)
Requirement already satisfied: argon2-cffi in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (20.1.0)
Requirement already satisfied: terminado>=0.8.3 in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (0.9.4)
Requirement already satisfied: Send2Trash>=1.5.0 in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (1.5.0)
Requirement already satisfied: ipykernel in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (5.3.4)
Requirement already satisfied: nbformat in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (5.1.3)
Requirement already satisfied: jupyter-client>=5.3.4 in c:\users\hp\anaconda3\lib\site-packages (from notebook>=4.2->jupyter-tabnine) (6.1.12)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\hp\anaconda3\lib\site-packages (from jupyter-client>=5.3.4->notebook>=4.2->jupyter-tabnine) (2.8.1)
Requirement already satisfied: pywin32>=1.0 in c:\users\hp\anaconda3\lib\site-packages (from jupyter-core->jupyter-tabnine) (227)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.1->jupyter-client>=5.3.4->notebook>=4.2->jupyter-tabnine) (1.15.0)
Requirement already satisfied: pywinpty>=0.5 in c:\users\hp\anaconda3\lib\site-packages (from terminado>=0.8.3->notebook>=4.2->jupyter-tabnine) (0.5.7)
Requirement already satisfied: cffi>=1.0.0 in c:\users\hp\anaconda3\lib\site-packages (from argon2-cffi->notebook>=4.2->jupyter-tabnine) (1.14.5)
Requirement already satisfied: pycparser in c:\users\hp\anaconda3\lib\site-packages (from cffi>=1.0.0->argon2-cffi->notebook>=4.2->jupyter-tabnine) (2.20)
Requirement already satisfied: decorator in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (5.0.6)
Requirement already satisfied: backcall in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (0.2.0)
Requirement already satisfied: pickleshare in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (0.17.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (52.0.0.post20210125)
Requirement already satisfied: matplotlib-inline in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (0.1.3)
Requirement already satisfied: colorama in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (0.4.4)
Requirement already satisfied: pygments in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (2.8.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\hp\anaconda3\lib\site-packages (from ipython->jupyter-tabnine) (3.0.17)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\hp\anaconda3\lib\site-packages (from jedi>=0.16->ipython->jupyter-tabnine) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\hp\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->jupyter-tabnine) (0.2.5)
Requirement already satisfied: MarkupSafe>=0.23 in c:\users\hp\anaconda3\lib\site-packages (from jinja2->notebook>=4.2->jupyter-tabnine) (1.1.1)
Requirement already satisfied: mistune<2,>=0.8.1 in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (0.8.4)
Requirement already satisfied: jupyterlab-pygments in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (0.1.2)
Requirement already satisfied: testpath in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (0.4.4)
Requirement already satisfied: entrypoints>=0.2.2 in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (0.3)
Requirement already satisfied: bleach in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (3.3.0)
Requirement already satisfied: pandocfilters>=1.4.1 in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (1.4.3)
Requirement already satisfied: defusedxml in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (0.7.1)
Requirement already satisfied: nbclient<0.6.0,>=0.5.0 in c:\users\hp\anaconda3\lib\site-packages (from nbconvert->jupyter-tabnine) (0.5.3)
Requirement already satisfied: async-generator in c:\users\hp\anaconda3\lib\site-packages (from nbclient<0.6.0,>=0.5.0->nbconvert->jupyter-tabnine) (1.10)
Requirement already satisfied: nest-asyncio in c:\users\hp\anaconda3\lib\site-packages (from nbclient<0.6.0,>=0.5.0->nbconvert->jupyter-tabnine) (1.5.1)
Requirement already satisfied: jsonschema!=2.5.0,>=2.4 in c:\users\hp\anaconda3\lib\site-packages (from nbformat->notebook>=4.2->jupyter-tabnine) (3.2.0)
Requirement already satisfied: pyrsistent>=0.14.0 in c:\users\hp\anaconda3\lib\site-packages (from jsonschema!=2.5.0,>=2.4->nbformat->notebook>=4.2->jupyter-tabnine) (0.17.3)
Requirement already satisfied: attrs>=17.4.0 in c:\users\hp\anaconda3\lib\site-packages (from jsonschema!=2.5.0,>=2.4->nbformat->notebook>=4.2->jupyter-tabnine) (20.3.0)
Requirement already satisfied: packaging in c:\users\hp\anaconda3\lib\site-packages (from bleach->nbconvert->jupyter-tabnine) (20.9)
Requirement already satisfied: webencodings in c:\users\hp\anaconda3\lib\site-packages (from bleach->nbconvert->jupyter-tabnine) (0.5.1)
Requirement already satisfied: pyparsing>=2.0.2 in c:\users\hp\anaconda3\lib\site-packages (from packaging->bleach->nbconvert->jupyter-tabnine) (2.4.7)
Installing collected packages: jupyter-tabnine
Successfully installed jupyter-tabnine-1.2.3

Installing C:\Users\HP\anaconda3\lib\site-packages\jupyter_tabnine\static -> jupyter_tabnine
Making directory: C:\ProgramData\jupyter\nbextensions\jupyter_tabnine\
Copying: C:\Users\HP\anaconda3\lib\site-packages\jupyter_tabnine\static\main.css -> C:\ProgramData\jupyter\nbextensions\jupyter_tabnine\main.css
Copying: C:\Users\HP\anaconda3\lib\site-packages\jupyter_tabnine\static\main.js -> C:\ProgramData\jupyter\nbextensions\jupyter_tabnine\main.js
Copying: C:\Users\HP\anaconda3\lib\site-packages\jupyter_tabnine\static\README.md -> C:\ProgramData\jupyter\nbextensions\jupyter_tabnine\README.md
Copying: C:\Users\HP\anaconda3\lib\site-packages\jupyter_tabnine\static\tabnine.yaml -> C:\ProgramData\jupyter\nbextensions\jupyter_tabnine\tabnine.yaml
- Validating: ok

    To initialize this nbextension in the browser every time the notebook (or other app) loads:

          jupyter nbextension enable jupyter_tabnine --py

Enabling notebook extension jupyter_tabnine/main...
      - Validating: ok
Enabling: jupyter_tabnine
- Writing config: C:\Users\HP\.jupyter
    - Validating...
      jupyter_tabnine  ok

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
data = [1,3,5,7,9]
data

[1, 3, 5, 7, 9]

In [5]:
pd.DataFrame(data,columns=["col1"])  # 1 column lik dataframe. column ismi var. Sütunları artabilir. indekslere label verebiliriz.
# DataFrame in her bir sütunu bir seridir.

   col1
0     1
1     3
2     5
3     7
4     9

In [6]:
pd.Series(data)  # Bu ise pandas serisi. Bunun ise sütun sayısı artmaz. indekslere label verebiliriz.

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [7]:
data2= np.arange(1,24,2).reshape(3,4)
data2

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [9]:
df = pd.DataFrame(data2,columns=["col1","col2","col3","col4"], index=["a","b","c"])
df

   col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.size

12

In [12]:
df.shape

(3, 4)

In [13]:
df.ndim

2

In [14]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [15]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int32
 1   col2    3 non-null      int32
 2   col3    3 non-null      int32
 3   col4    3 non-null      int32
dtypes: int32(4)
memory usage: 72.0+ bytes

In [18]:
df.values

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [19]:
len(df)

3

In [20]:
df.keys()

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [21]:
df.col1

a     1
b     9
c    17
Name: col1, dtype: int32

In [22]:
df["col1"]

a     1
b     9
c    17
Name: col1, dtype: int32

In [23]:
s1 = np.random.randint(2,10, size = 40)
s2 = np.random.randint(30,100, size = 40)
s3 = np.random.randint(100,150, size = 40)

In [26]:
my_dict = {"var1":s1,"var2":s2,"var3":s3}
my_dict

{'var1': array([8, 4, 8, 8, 8, 9, 4, 7, 7, 3, 5, 7, 2, 5, 4, 7, 5, 2, 7, 3, 9, 6,
        8, 9, 5, 5, 2, 4, 4, 8, 8, 5, 7, 5, 9, 4, 9, 8, 7, 9]),
 'var2': array([44, 69, 82, 88, 70, 89, 73, 83, 44, 62, 95, 32, 54, 99, 77, 46, 72,
        42, 77, 35, 50, 58, 86, 40, 41, 93, 63, 95, 34, 76, 50, 54, 98, 40,
        34, 61, 79, 37, 43, 77]),
 'var3': array([103, 146, 127, 147, 149, 117, 100, 149, 126, 139, 141, 129, 108,
        129, 136, 117, 118, 139, 107, 143, 119, 108, 120, 129, 130, 139,
        132, 100, 127, 108, 110, 117, 106, 128, 145, 139, 115, 119, 147,
        131])}

In [28]:
df_dict = pd.DataFrame(my_dict)
df_dict

    var1  var2  var3
0      8    44   103
1      4    69   146
2      8    82   127
3      8    88   147
4      8    70   149
5      9    89   117
6      4    73   100
7      7    83   149
8      7    44   126
9      3    62   139
10     5    95   141
11     7    32   129
12     2    54   108
13     5    99   129
14     4    77   136
15     7    46   117
16     5    72   118
17     2    42   139
18     7    77   107
19     3    35   143
20     9    50   119
21     6    58   108
22     8    86   120
23     9    40   129
24     5    41   130
25     5    93   139
26     2    63   132
27     4    95   100
28     4    34   127
29     8    76   108
30     8    50   110
31     5    54   117
32     7    98   106
33     5    40   128
34     9    34   145
35     4    61   139
36     9    79   115
37     8    37   119
38     7    43   147
39     9    77   131

In [29]:
df_dict[3:5]

   var1  var2  var3
3     8    88   147
4     8    70   149

In [31]:
df = df_dict[3:5]
df

   var1  var2  var3
3     8    88   147
4     8    70   149

In [35]:
df.index = ["a","b"]
df

   var1  var2  var3
a     8    88   147
b     8    70   149

In [39]:
df.columns = ["X","Y","Z"]
df

   X   Y    Z
a  8  88  147
b  8  70  149

In [41]:
np.random.seed(101)
df = pd.DataFrame(np.random.randn(5,4),
                  index = "A B C D E".split(),
                  columns = "W X Y Z".split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [43]:
type(df["W"])

pandas.core.series.Series

In [44]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [45]:
df[["W"]]  # iki list içinde 2 dimensional ve data frame oldu.

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [46]:
df[["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [48]:
df.loc[:,"W":"Y"]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [49]:
df.loc["B":"D","W":"Z"]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [50]:
df["X"]

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [51]:
df["X"]+df["Y"]*2

A    2.444072
B   -2.015472
C    1.797749
D   -2.625346
E    7.190692
dtype: float64

In [70]:
df["Result"] = df["W"]*df["X"]+df["Y"].std()-df["Z"].mean()+100
df
#for döngüsündeki gibi her bir satır için bu işlemi yaparak result olarak yazar.

          W         X         Y         Z      Result
A  2.706850  0.628133  0.907969  0.503826  102.722906
B  0.651118 -0.319318 -0.848077  0.605965  100.814731
C -2.018168  0.740122  0.528813 -0.589001   99.528954
D  0.188695 -0.758872 -0.933237  0.955057  100.879449
E  0.190794  1.978757  2.605967  0.683509  101.400180

In [71]:
df.drop(["Y","Result"], axis=1)  # eğer bunu bir değişkene eşitlersek kalıcı değişiklik yapmış oluruz.
# axis=1 ile sütunlarda işlem yapıyorum.

          W         X         Z
A  2.706850  0.628133  0.503826
B  0.651118 -0.319318  0.605965
C -2.018168  0.740122 -0.589001
D  0.188695 -0.758872  0.955057
E  0.190794  1.978757  0.683509

In [72]:
df.drop(["X"], axis=1, inplace=True) # buda kalıcı değişiklik yapar.
df

          W         Y         Z      Result
A  2.706850  0.907969  0.503826  102.722906
B  0.651118 -0.848077  0.605965  100.814731
C -2.018168  0.528813 -0.589001   99.528954
D  0.188695 -0.933237  0.955057  100.879449
E  0.190794  2.605967  0.683509  101.400180

In [76]:
m=np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0    23    22    22    18
1    24    31    37     8
2    21    28    12     6
3    23    26    19    14
4    39     4    15    24
5    14    25    21     1
6    30    12    28    34
7    25    37    39    10

In [77]:
df4.loc[2:6]

   var1  var2  var3  var4
2    21    28    12     6
3    23    26    19    14
4    39     4    15    24
5    14    25    21     1
6    30    12    28    34

In [78]:
df4.index='a b c d e f g h'.split()
df4

   var1  var2  var3  var4
a    23    22    22    18
b    24    31    37     8
c    21    28    12     6
d    23    26    19    14
e    39     4    15    24
f    14    25    21     1
g    30    12    28    34
h    25    37    39    10

In [82]:
df4.loc[2]   # çünkü sadece location olarak alır.

KeyError: 2

In [84]:
df4.loc["c"]

var1    21
var2    28
var3    12
var4     6
Name: c, dtype: int32

In [85]:
df4.loc["c":"f"]

   var1  var2  var3  var4
c    21    28    12     6
d    23    26    19    14
e    39     4    15    24
f    14    25    21     1

In [86]:
df4.loc["c":"f","var1":"var3"]

   var1  var2  var3
c    21    28    12
d    23    26    19
e    39     4    15
f    14    25    21

In [87]:
df4.loc["c":"f"][["var1","var2","var3"]]

   var1  var2  var3
c    21    28    12
d    23    26    19
e    39     4    15
f    14    25    21

In [89]:
df4.iloc[:]

   var1  var2  var3  var4
a    23    22    22    18
b    24    31    37     8
c    21    28    12     6
d    23    26    19    14
e    39     4    15    24
f    14    25    21     1
g    30    12    28    34
h    25    37    39    10

In [90]:
df4.iloc[1:4,2:4]   # son rakamlar normla indekslemede olduğu gibi dahil değildir.

   var3  var4
b    37     8
c    12     6
d    19    14

In [93]:
df4.iloc[1:4,2:3]

   var3
b    37
c    12
d    19

In [94]:
df4.iloc[:,2:]

   var3  var4
a    22    18
b    37     8
c    12     6
d    19    14
e    15    24
f    21     1
g    28    34
h    39    10

In [96]:
m=np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4
df4[df4["var1"] > 0]

   var1  var2  var3  var4
0     4     2    16     5
1     5    37    19    15
2    29    18    24    17
3     7     8    21    11
4    33    24    23    22
5    27    13     3    18
6     2    26     3    17
7     3    25    16    30

In [97]:
df4[(df4["var1"]>0)&(df4["var2"]>0)]

   var1  var2  var3  var4
0     4     2    16     5
1     5    37    19    15
2    29    18    24    17
3     7     8    21    11
4    33    24    23    22
5    27    13     3    18
6     2    26     3    17
7     3    25    16    30

In [99]:
df4[(df4.var1)>0 & (df4.var2 >0)]

   var1  var2  var3  var4
0     4     2    16     5
1     5    37    19    15
2    29    18    24    17
3     7     8    21    11
4    33    24    23    22
5    27    13     3    18
6     2    26     3    17
7     3    25    16    30

In [100]:
df4[df4.var1>0][["var2"]]

   var2
0     2
1    37
2    18
3     8
4    24
5    13
6    26
7    25

In [101]:
df_1 = df4[df4.var1 > 0 ]
df_1

   var1  var2  var3  var4
0     4     2    16     5
1     5    37    19    15
2    29    18    24    17
3     7     8    21    11
4    33    24    23    22
5    27    13     3    18
6     2    26     3    17
7     3    25    16    30

In [104]:
df_1["var2"]

0     2
1    37
2    18
3     8
4    24
5    13
6    26
7    25
Name: var2, dtype: int32